app/views/admin/railway_stations/show.html.erb


<% if @railway_station.routes.empty? %>
---
SELECT "routes".* FROM "routes" INNER JOIN "railway_stations_routes" ON "routes"."id" = "railway_stations_routes"."route_id" WHERE "railway_stations_routes"."railway_station_id" = ?  [["railway_station_id", 1]]
SELECT 1 AS one FROM "routes" INNER JOIN "railway_stations_routes" ON "routes"."id" = "railway_stations_routes"."route_id" WHERE "railway_stations_routes"."railway_station_id" = ? LIMIT ?  [["railway_station_id", 1], ["LIMIT", 1]]

	<ul>
		<% @railway_station.routes.each do |route| %>
---
SELECT "routes".* FROM "routes" INNER JOIN "railway_stations_routes" ON "routes"."id" = "railway_stations_routes"."route_id" WHERE "railway_stations_routes"."railway_station_id" = ?  [["railway_station_id", 1]]