app/views/trains/_form.html.erb

    <%= f.label :current_station, "Текущая станция" %>
    <%= f.collection_select :current_station_id, RailwayStation.all, :id, :title %>
---
SELECT "railway_stations".* FROM "railway_stations"