app/controllers/admin/railway_stations_controller.rb

  def index
    @railway_stations = RailwayStation.all
---
SELECT "railway_stations".* FROM "railway_stations"

    def set_railway_station
      @railway_station = RailwayStation.find(params[:id])
---
SELECT "railway_stations".* FROM "railway_stations" WHERE "railway_stations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]