app/controllers/routes_controller.rb

SELECT "routes".* FROM "routes"
---
  def index
  	@routes = Route.all

SELECT "routes".* FROM "routes" WHERE "routes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_route
  	@route = Route.find(params[:id])