app/controllers/searches_controller.rb

  def show
    if start_station_param
      @stations       = RailwayStation.all
---
SELECT "railway_stations".* FROM "railway_stations"