app/controllers/tickets_controller.rb

  def show
    @ticket = Ticket.find(params[:id])
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @ticket = current_user.tickets.new(station_params)

    if @ticket.save
---
INSERT INTO "tickets" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 2], ["created_at", "2020-08-07 13:49:16.707312"], ["updated_at", "2020-08-07 13:49:16.707312"]]