app/controllers/trains_controller.rb

INSERT INTO "trains" ("number", "created_at", "updated_at", "current_station_id") VALUES (?, ?, ?, ?)  [["number", "777"], ["created_at", "2020-08-04 14:52:20.364457"], ["updated_at", "2020-08-04 14:52:20.364457"], ["current_station_id", 4]]
---
  def create
  	@train = Train.new(train_params)

  	if @train.save

UPDATE "trains" SET "current_station_id" = ?, "updated_at" = ? WHERE "trains"."id" = ?  [["current_station_id", 3], ["updated_at", "2020-08-04 14:52:05.933140"], ["id", 1]]
---
  def update
  	if @train.update(train_params)

DELETE FROM "trains" WHERE "trains"."id" = ?  [["id", 2]]
---
  def destroy
  	@train.destroy

SELECT "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_train
  	@train = Train.find(params[:id])