app/views/admin/trains/_form.html.erb

SELECT "railway_stations".* FROM "railway_stations"
---
    <%= f.label :current_station %>
    <%= f.collection_select :current_station_id, RailwayStation.all, :id, :title %>